const express = require("express");
const cors = require("cors");
const ip = require("ip");
const app = express();
const path = require("path");
const jwt = require("jsonwebtoken");
const bcrypt = require("bcrypt");
const swaggerUi = require("swagger-ui-express");

const fs = require("fs");
const YAML = require("yaml");
const file = fs.readFileSync("src/swagger.yaml", "utf8");
const swaggerDoc = YAML.parse(file);

app.use("/api-docs", swaggerUi.serve, swaggerUi.setup(swaggerDoc));

const corsOptions = {
  origin: "http://localhost",
};

//port
const port = process.env.PORT || 8080;
const db = require(".");

const Recipe = db.recipes;
const Category = db.categories;
const User = db.users;

//middleware
app.use(cors(corsOptions));
app.use(express.json());
app.use(express.urlencoded({ extended: true }));

(async () => {
  await db.sequelize
    .sync({ force: true })
    .then((data) => {
      const categories = Category.bulkCreate([
        { categoryName: "Egg" },
        { categoryName: "Beef" },
        { categoryName: "Chicken" },
        { categoryName: "Pork" },
        { categoryName: "Vegetarian" },
      ]);
      const superUser = User.create({
        userName: "superuser",
        userEmail: "superuser01@mail.com",
        password:
          "$2b$10$dRcsEB1USbHe6gAhnHFEXOxUAMytTCjGnzkfzfeeHLPjye853YxEe",
        role: "Admin",
      });
      const recipe = Recipe.bulkCreate([
        {
          recipeName: "Spaghetti Carbonara",
          cookingSteps:
            "1. ต้มน้ำให้เดือด แล้วใส่เกลือลงไป จากนั้นใส่เส้นสปาเก็ตตี้ ลงไปต้ม ใช้เวลาต้มประมาณ 4-6 นาที จะได้เส้นที่สุกกำลังดี\n 2. นำไข่ไก่มาแยกไข่แดงออกจากไข่ขาว\n 3.นำเบคอนมาผัดในกระทะจนเหลืองหอม จากนั้นผัดหอมใหญ่จนเริ่มสุก\n 4. ใส่วิปครีมลงไป คนจนวิปครีมเดือด ให้ใส่พาเมซานชีส คนจนชีสละลายดี จากนั้นปรุงด้วยเกลือและพริกไทย\n 5. จัดใส่จานพร้อมเสิร์ฟ",
          cookingIngredients:
            "1. เส้นสปาเก็ตตี้ 50 กรัม\n 2.เบคอน 50 กรัม\n 3.หอมใหญ่ 30 กรัม\n 4.พาร์สลีย์\n 5.วิปครีม 500 มิลลิลิตร\n 6.พาเมซานชีส 1/2 ช้อนโต๊ะ\n 7.เกลือ 1/8 ช้อนชา\n 8.ไข่แดง 1 ฟอง",
          introduce:
            "สปาเก็ตตี้คาโบนาร่าเป็นอาหารพื้นเมืองของอิตาลีที่มีเส้นสปาเก็ตตี้นุ่มๆ รับรสหวานจากไข่และเกลือ และมีรสชาติเข้มข้นจากพาเมซานชีสและเบคอนที่อบกรอบ อาหารชนิดนี้มีชื่อเสียงทั่วโลกและเป็นที่นิยมอย่างมาก โดยมักจะเสริฟพร้อมกับขนมปังหรือขนมปังกรอบ เป็นเมนูที่เหมาะสำหรับคนที่ชื่นชอบอาหารอิตาเลียนและความหรูหราของรสชาติที่เข้มข้น",
          categoryId: [4],
          recipeImage: "dist\\images\\Spagetti_Carbonara.jpg",
          video: "https://www.youtube.com/embed/mRoaxyGLHgw",
          nutAllergy: "1",
        },
        {
          recipeName: "Pan-fried eggs",
          cookingSteps:
            "1.หั่นครึ่ง ไส้กรอก แฮม เบคอน และ โบโลน่า เตรียมไว้\n 2.ตั้งกระทะใช้ไฟกลางค่อนอ่อน ใส่เนยลงไปรอจนละลาย แล้วใส่เบคอนลงทอดให้พอกรอบ ตามด้วยไส้กรอก แฮม และโบโลน่า เมื่อทุกอย่างพอเปลี่ยนสี จัดให้ไปอยู่ข้างใดข้างหนึ่งให้สวยงาม นำโบโลน่าออกก่อน แล้วตอกไข่ใส่ลงไป ม้วนโบโลน่าให้เป็นรูปดอกไม้ แล้วนำมาวางตรงไข่ขาวที่ยังไม่สุกดี เพื่อให้ไข่ขาวช่วยพยุงโบโลน่าให้อยู่ตัว\n 3.เมื่อไข่เริ่มสุก โรยด้วยมะเขือเทศหั่นเต๋า แล้วปิดไฟ โรยด้วยต้นหอมซอย ปรุงรสด้วยซีอิ๊วขาว และพริกไทย เพียงแต่นี้ “ไข่กระทะ” สไตล์อเมริกันก็พร้อมจัดเสิร์ฟให้เรารับประทาน ",
          cookingIngredients:
            "1.ไข่ไก่ 2 ฟอง\n 2.แฮม 2 แผ่น\n 3.ไส้กรอก 2 ชิ้น\n 4.sเบคอน 2 ชิ้น\n 5.โบโลน่า 2 แผ่น\n 6.มะเขือเทศหั่นเต๋า ½ ถ้วย\n 7.ต้นหอมซอย 1 ต้น\n 8.เนย 2 ช้อนโต๊ะ\n 9.ซีอิ๊ว และพริกไทย",
          introduce:
            "ไข่กระทะ เมนูอาหารเช้าทำง่าย สามารถหาวัตถุดิบได้จากร้านค้า หรือห้างสรรพสินค้าทั่วไป โดยใช้เวลาเตรียมวัตถุดิบไม่นาน และมีขั้นตอนแน่นอนว่านอกจากความอร่อย ทำง่าย กินง่าย ไข่กระทะยังอุดมไปด้วยสารอาหารครบที่จำเป็นต่อร่างกาย ดีต่อใจและดีต่อสุขภาพ",
          categoryId: [1],
          recipeImage: "dist\\images\\Pan_Fried_Egg.jpg",
          nutAllergy: "1",
        },
        {
          recipeName: "Beaf Steak",
          cookingSteps:
            "1. ปรุงเนื้อสเต็กด้วยเกลือและพริกไทย\n2. เปิดไฟกระทะหรือเตาแล้วนำเนื้อสเต็กไปย่างจนสุกตามระดับความพอดี ประมาณ 4-5 นาทีต่อด้านสำหรับเนื้อสเต็กปริมาณ 1 นิ้ว\n3. นำเนื้อสเต็กออกจากไฟแล้วปล่อยให้พักสักครู่ก่อนหั่น\n4. เสริฟเนื้อสเต็กพร้อมกับอาหารที่ชอบ",
          cookingIngredients:
            "1. เนื้อสเต็ก หนา 1 นิ้ว\n2. เกลือ ตามรสชาติ\n3. พริกไทย ตามรสชาติ\n4. น้ำมันมะกอก สำหรับย่าง\n5. อื่นๆ: กระเทียม, โรสแมรี่ หรือสมุนไพรต่างๆ สำหรับปรุงรส",
          introduce:
            "สเต็กเนื้อเป็นเมนูอาหารที่เป็นที่นิยมและเหมาะสำหรับทุกโอกาส ไม่ว่าจะเป็นการย่างนอกบ้านหรือใช้กระทะบนเตา สำคัญคือการปรุงรสด้วยเกลือและพริกไทยอย่างเหมาะสม และนำไปย่างให้สุกตามรสชาติที่ต้องการ ให้เสิร์ฟพร้อมกับมันสำปะหลังสับ, ผักย่าง หรือสลัดสดเพื่อได้เมนูครบถ้วน",
          categoryId: [2],
          recipeImage: "dist\\images\\steak.jpg",
          nutAllergy: "0",
        },
        {
          recipeName: "Beef Rice Bowl",
          cookingSteps:
            "1.นำซีอิ๊วญี่ปุ่น สาเก มิริน และดาชิ มาผสมกันในชามผสม แล้วพักไว้\n 2.ตั้งกระทะใช้ไฟกลาง ใส่น้ำมันงาลงไป เมื่อน้ำมันร้อน ใส่เนื้อวัว และน้ำตาลลงไป ผัดจนเนื้อเกือบสุก แล้วตักขึ้นพักไว้เปลี่ยนกระทะใหม่ ใส่หอมใหญ่ ขิงขูด และส่วนผสมน้ำซอสที่เตรียมไว้ลงในกระทะ ก่อนผัดให้หอมใหญ่เริ่มนิ่ม จากนั้นต้มต่อให้พอเดือด ใส่เนื้อที่ผัดเตรียมไว้ลงไป ผัดด้วยความเร็วให้พอเข้ากัน ก่อนปิดไฟยกลง \n 3.นำเนื้อที่ผัดตักราดบนข้าวญี่ปุ่น ตอกไข่ลงไป และตกแต่งด้วยต้นหอมญี่ปุ่น ขิงดองสีแดง และสาหร่าย ก่อนโรยด้วยพริกญี่ปุ่นพร้อมจัดเสิร์ฟให้เรารับประทาน ",
          cookingIngredients:
            "1. เนื้อวัวแล่บาง 150 กรัม\n 2. หอมใหญ่หั่นเสี้ยว 3/4 ถ้วยตวง\n 3. ขิงขูด 1 ช้อนโต๊ะ\n 4. ซีอิ๊วญี่ปุ่น 3 ช้อนโต๊ะ\n 5. สาเก 2 ช้อนโต๊ะ\n 6. มิริน 2 ช้อนโต๊ะ\n 7. ดาชิ ¼ ถ้วยตวง\n 8. น้ำมันงา 2 ช้อนชา\n 9. น้ำตาลทราย 1 ช้อนชา\n 10. ไข่ไก่ 1 ฟอง\n 11. ขิงดองสีแดง สำหรับกินคู่\n 12. สาหร่าย สำหรับโรยหน้า\n 13. ต้นหอมญี่ปุ่นซอย สำหรับโรยหน้า\n 14. พริกป่นญี่ปุ่น สำหรับโรยหน้า\n 15. ข้าวสวยญี่ปุ่น",
          introduce:
            "ข้าวหน้าเนื้อ ถือว่าเป็นอาหารฟาสต์ฟู้ดของชาวญี่ปุ่น เป็นเมนูง่ายๆ และรวดเร็ว แถมยังอิ่มนาน สารอาหารครบถ้วนอีกด้วย",
          categoryId: [2],
          recipeImage: "dist\\images\\beef_rice.jpg",
          nutAllergy: "0",
        },
        {
          recipeName: "Crispy Chick Fried",
          cookingSteps:
            "1. นำไก่ที่ผ่าดอกออกมาทำความสะอาดและเช็ดแห้ง\n2. ผสมแป้งทอดกรอบกับเกลือ พริกไทย และเครื่องปรุงรสตามชอบ\n3. จากนั้นนำไก่มาหล่อนแป้งทอดกรอบให้ทั่ว\n4. ทอดในน้ำมันร้อนจนเหลืองกรอบและสุกทั้งสองด้าน\n5. ตักใส่จานพร้อมเสิร์ฟ",
          cookingIngredients:
            "1. ไก่บด 500 กรัม\n2. แป้งทอดกรอบ 1 ถ้วย\n3. เกลือ 1 ช้อนชา\n4. พริกไทย 1/2 ช้อนชา\n5. น้ำมันร้อน สำหรับทอด",
          introduce:
            "เมนูอาหารทอดกรอบที่มีรสชาติเครื่องเทศกลมกล่อมและกรอบนุ่มที่ยากจะหาที่ไหนได้ใกล้เคียง เป็นเมนูที่เหมาะสำหรับทุกเพศทุกวัย ทานได้ทั้งเป็นอาหารหลักหรือเป็นอาหารว่าง",
          categoryId: [3],
          recipeImage: "dist\\images\\chicken_fried.jpg",
          nutAllergy: "0",
        },
        {
          recipeName: "Stir-fried vegetarian",
          cookingSteps:
            "1. หมักเนื้อให้สุกในน้ำปลา ซีอิ๊ว น้ำตาล และพริกไทย\n2. ตั้งกระทะใส่น้ำมันลงไป พอน้ำมันร้อนใส่กระเทียมและพริกไทยสดลงไปผัดจนหอม\n3. ใส่เนื้อหมักที่หมักไว้ลงไปผัดจนสุก\n4. ใส่ผักต่างๆ เช่น คะน้า กะหล่ำปลี ผักชี และพริกลงไปผัด\n5. ปรุงรสตามชอบ จัดเสิร์ฟพร้อมข้าวสวย",
          cookingIngredients:
            "1. เนื้อหมู 200 กรัม\n2. คะน้า 100 กรัม\n3. กะหล่ำปลี 100 กรัม\n4. ผักชี 50 กรัม\n5. พริกแห้ง ตามชอบ\n6. กระเทียมสับ 2 ช้อนโต๊ะ\n7. ซอสหอยนางรม 2 ช้อนโต๊ะ\n8. ซอสปรุงรส 1 ช้อนโต๊ะ\n9. น้ำตาลทราย 1 ช้อนชา\n10. น้ำปลา 1 ช้อนโต๊ะ\n11. พริกไทยป่น 1 ช้อนชา\n12. น้ำมันพืช 2 ช้อนโต๊ะ",
          introduce:
            "เมนูผัดผักเป็นอาหารที่มีรสชาติหอม อร่อย และสีสันสดใส มีความเผ็ดน้อยพอดีกับคนไทย สามารถเพิ่มหรือลดระดับความเผ็ดได้ตามชอบ",
          categoryId: [5],
          recipeImage: "dist\\images\\stir_fried_vegetables.jpg",
          nutAllergy: "0",
          vegetarian: "0",
        },
        {
          recipeName: "Vegetarian Salad",
          cookingSteps:
            "1. ล้างผักทุกชนิดให้สะอาด\n2. หั่นผักเป็นชิ้นเล็กๆ\n3. ผสมผักทุกชนิดในชามใหญ่\n4. ปรุงน้ำสลัด: ผสมน้ำมันมะพร้าว, มะนาว, น้ำตาล, ซอสซอย, และเกลือให้เข้ากัน\n5. รวมน้ำสลัดกับผักและคนให้เข้ากัน\n6. ตักสลัดใส่จานเสิร์ฟพร้อมกับเมล็ดที่แต่งด้วย",
          cookingIngredients:
            "1. ผักสดต่างๆ เช่น ผักกาดหอม, ผักกาดแก้ว, คะน้า, และผักสี\n2. เมล็ดแต่งสลัด เช่น ถั่วลิสง, ถั่วเหลือง, และเมล็ดทานตะวัน\n3. น้ำมันมะพร้าว 2 ช้อนโต๊ะ\n4. มะนาว 2 ลูก\n5. น้ำตาลทราย 1 ช้อนชา\n6. ซอสซอย 1 ช้อนโต๊ะ\n7. เกลือ ตามชอบ",
          introduce:
            "สลัดผักมังสวิรัติเป็นอาหารที่เสริมสร้างสุขภาพด้วยผักสดและเมล็ดที่อุดมไปด้วยโภชนาการ มีรสชาติหวานเปรี้ยวจากมะนาวและน้ำตาล และมีความเค็มน้อยจากเกลือ",
          categoryId: [5],
          recipeImage: "dist\\images\\salad_nut.jpg",
          nutAllergy: "1",
          vegetarian: "1",
        },
        {
          recipeName: "Vegetarian fried rice",
          cookingSteps:
            "1. หั่นมังสวิรัติเป็นชิ้นเล็กๆ\n2. ตั้งกระทะให้ร้อน และใส่น้ำมันพืช\n3. ใส่มังสวิรัติลงไปผัดจนเริ่มนิ่ม\n4. ใส่ข้าวสวยลงไปผัดให้เข้ากัน\n5. ปรุงรสตามชอบ เช่น ซอสซอย, น้ำปลา, น้ำมันหอย\n6. ตักข้าวผัดมังสวิรัติใส่จานเสิร์ฟพร้อมผักสด",
          cookingIngredients:
            "1. มังสวิรัติสด\n2. ข้าวสวย\n3. น้ำมันพืช\n4. ซอสซอย\n5. น้ำปลา\n6. น้ำมันหอย\n7. ผักสดต่างๆ เช่น ผักกาด, กะหล่ำปลี, แตงกวา",
          introduce:
            "ข้าวผัดมังสวิรัติเป็นอาหารสำหรับคนที่รักในรสชาติของมังสวิรัติ มีกลิ่นหอมจากการผัดอย่างสุดคลายใจ สามารถเพิ่มผักสดเพื่อความเป็นสุขภาพมากขึ้นได้",
          categoryId: [5],
          recipeImage: "dist\\images\\vegan_fried_rice.jpg",
          nutAllergy: "0",
          vegetarian: "1",
        },
      ]);
      console.log("Table and model has been synced");
    })
    .catch((err) => {
      console.log(err, "Error syncing the table and model");
    });
})();

// (async () => {
//   await db.sequelize
//     .sync()
//     .then((data) => {
//       console.log("Table and model created");
//     })
//     .catch((err) => {
//       console.log("Error created");
//     });
// })();

//routes
const router = require("./routes");
const multer = require("multer");
const { recipesData } = require("./app/recipe/mockup");
app.use("/api", router);

//static img folder
app.use("/dist/images", express.static("dist/images"));

//server
app.get("/", (req, res) => {
  res.status(200).json({ message: "Hello from api!" });
});

app.listen(port, () =>
  console.log(`[server] listening on: ${ip.address()}:${port}`)
);
